# print() არის ფუნქცია
# ფუნქციას ყოველთვის აქვს გამხსნელი და დამხურავი ფრჩხილები ()
# ყველა ფუნქციას აქვს დანიშნულება
# print() დანიშნულება არის რომ ტერმინალში გამოიტანოს მნიშვნელობები
# parenthess - ფრხილები
# data types / მონაცემთა ტიპები 16-14 მონაცემთა ტიპი
# ტექსტუალური მონაცემები / string -- ბრჭყალებში მოთავსებული ტექსტი '' --- ""
# ციფრული მონაცემები integer , float , -------------- imaginary number
# int --- 1,2,3,4,5,6,7,8,9,10,11,12 -- მთელი რიცხვები
# float --- 1.4 , 1.5 , 111.667 , 1235.67841 -- ათწილადი
# imaginary number -- 3 + 5j ----- ეს არ გვინდა ! ! ! 🐐
# ციფრებს შუძლიათ მათემატიკური ოპერაციების განსაზღვრა

# string vs numeric nimbers ---- str არ ემატება numeric numbers
# print(" გოას " + 12.2 ) არ შეიძლება ❌

print(3 + 5)
print(3 + 5.5)

"გამარჯობა სამყარო"

print(" გამარჯობა სამყარო ")
# ცვლადი --- variable
# ცვლადები ინახავენ მნიშვნელობებს

# ლოგიკური სახელები შევისაბამოთ
name =  'დავით '
numbers = 1
sentence = ' დათვი ჭამს ვაშლს🐻 '

# სადაც გამოვიძახებთ / დავწერთ ცვლადის სახელს ყველგან გამოვა მინის მნიშვნელობა ანუ რასაც იმახსოვრებს ეს ცვლადი

# ცვლადი ინახავს მნიშვნელობას
# ცვლადის სახელი, = ხდება მნიშვნელობის მინიჭება , მნიშვნელობა
# = დეკლარაცია ---- = ხდება მნიშვნელობის მინიჭება
# ცვლადის სახელი , დეკლარაცია , ცვლადის ენიჭება მნიშვნელობა

country = " საქართველო "
# ბრჭყალების გარეშე რასაც დავწერ ყველაფერი მოისაზრება როგორც ცვლადის სახელი
country
print("------------------------")

# 
# 
player = 14
speed = 0.5

# სტანდარტული ვერსია პითოსნისცვლადების ჩაწერისას snake_case, calem_case --- js -ში
# რა არ შეიძლება ცვლადის შექმნის დროს პირველი ასო არ უნდა იყოს პატარათი დაწერილი p  არა  P არ ვიწყებთ 1234 ციფრებით _მოსულა
player_speed = " ასდას "
print(player-1)
print(speed+1.5)
